In [10]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

In [11]:
%%sql
SELECT *
FROM import_coursemeetingsF14
LIMIT 10

 * sqlite:///CourseData.db
Done.

[('70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

In [12]:
%%sql
DROP TABLE IF EXISTS coursemeetings;
CREATE TABLE coursemeetings (
    crn INTEGER NOT NULL,
    location TEXT NOT NULL,
    day TEXT NOT NULL,
    start TEXT NOT NULL,
    end TEXT NOT NULL);

 * sqlite:///CourseData.db
Done.
Done.

[]

In [13]:
%%sql
select * from coursemeetings
limit 10;

 * sqlite:///CourseData.db
Done.

[]

In [14]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsF14

 * sqlite:///CourseData.db
31505 rows affected.

[]

In [15]:
%%sql
SELECT *
FROM import_coursemeetingsF14
LIMIT 10

 * sqlite:///CourseData.db
Done.

[('70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

In [16]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(31505,)]

In [17]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsF15

 * sqlite:///CourseData.db
31456 rows affected.

[]

In [18]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(62961,)]

In [19]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsF16

 * sqlite:///CourseData.db
31474 rows affected.

[]

In [20]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(94435,)]

In [21]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsF17

 * sqlite:///CourseData.db
31400 rows affected.

[]

In [22]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(125835,)]

In [23]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsF18

 * sqlite:///CourseData.db
33440 rows affected.

[]

In [24]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(159275,)]

In [25]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsS15

 * sqlite:///CourseData.db
31936 rows affected.

[]

In [26]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(191211,)]

In [27]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsS16

 * sqlite:///CourseData.db
33132 rows affected.

[]

In [28]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(224343,)]

In [29]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsS17

 * sqlite:///CourseData.db
32405 rows affected.

[]

In [30]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(256748,)]

In [31]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsS18

 * sqlite:///CourseData.db
31711 rows affected.

[]

In [32]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(288459,)]

In [33]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsS19

 * sqlite:///CourseData.db
28348 rows affected.

[]

In [34]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(316807,)]

In [35]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsSB17

 * sqlite:///CourseData.db
5 rows affected.

[]

In [36]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(316812,)]

In [37]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsSU15

 * sqlite:///CourseData.db
2584 rows affected.

[]

In [38]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(319396,)]

In [39]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsSU16

 * sqlite:///CourseData.db
3007 rows affected.

[]

In [40]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(322403,)]

In [41]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsSU17

 * sqlite:///CourseData.db
2666 rows affected.

[]

In [42]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(325069,)]

In [43]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsSU18

 * sqlite:///CourseData.db
2624 rows affected.

[]

In [44]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(327693,)]

In [45]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsW15

 * sqlite:///CourseData.db
101 rows affected.

[]

In [46]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(327794,)]

In [47]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsW16

 * sqlite:///CourseData.db
106 rows affected.

[]

In [48]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(327900,)]

In [49]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsW17

 * sqlite:///CourseData.db
213 rows affected.

[]

In [50]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(328113,)]

In [51]:
%%sql
INSERT INTO coursemeetings (crn,location,day,start,end)
SELECT crn,location,day,start,end
FROM import_coursemeetingsW18

 * sqlite:///CourseData.db
93 rows affected.

[]

In [52]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(328206,)]

In [56]:
%%sql
DROP TABLE courses;
CREATE TABLE courses (
    crn INTEGER NOT NULL,
    catalog_id TEXT NOT NULL,
    section TEXT NOT NULL,
    credits FLOAT NOT NULL,
    title TEXT NOT NULL,
    meetings TEXT NOT NULL,
    timecodes TEXT NOT NULL,
    primary_instructor TEXT NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL);

 * sqlite:///CourseData.db
Done.
Done.

[]

In [57]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF14

 * sqlite:///CourseData.db
1522 rows affected.

[]

In [58]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF15

 * sqlite:///CourseData.db
1475 rows affected.

[]

In [59]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(2997,)]

In [60]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF16

 * sqlite:///CourseData.db
1491 rows affected.

[]

In [61]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(4488,)]

In [62]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF17

 * sqlite:///CourseData.db
1479 rows affected.

[]

In [63]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF18

 * sqlite:///CourseData.db
1519 rows affected.

[]

In [64]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(7486,)]

In [65]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS15

 * sqlite:///CourseData.db
1738 rows affected.

[]

In [66]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS16

 * sqlite:///CourseData.db
1698 rows affected.

[]

In [67]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS17

 * sqlite:///CourseData.db
1721 rows affected.

[]

In [68]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS18

 * sqlite:///CourseData.db
1719 rows affected.

[]

In [69]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(14362,)]

In [70]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS19

 * sqlite:///CourseData.db
1473 rows affected.

[]

In [71]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(15835,)]

In [72]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSB17

 * sqlite:///CourseData.db
1 rows affected.

[]

In [73]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU15

 * sqlite:///CourseData.db
316 rows affected.

[]

In [74]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU16

 * sqlite:///CourseData.db
310 rows affected.

[]

In [75]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU17

 * sqlite:///CourseData.db
285 rows affected.

[]

In [76]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU18

 * sqlite:///CourseData.db
313 rows affected.

[]

In [77]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(17060,)]

In [78]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW15

 * sqlite:///CourseData.db
25 rows affected.

[]

In [79]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW16

 * sqlite:///CourseData.db
28 rows affected.

[]

In [80]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW17

 * sqlite:///CourseData.db
24 rows affected.

[]

In [81]:
%%sql
INSERT INTO courses (crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW18

 * sqlite:///CourseData.db
28 rows affected.

[]

In [82]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(17165,)]